{"data":{"posts":{"edges":[{"node":{"frontmatter":{"title":"Introduction","type":"post","content":null,"color":"#f1bd88","backcolor":"#fffdfa"},"html":"<p>Welkom!</p>\n<p>I'm Ben, it's nice to meet you!</p>\n<p>I'm a software developer at heart, and I just so happen to do this during the\nday at work. I like to add something back to the world by making enterprise\ngrade software that stops people from having to do monotonous jobs, freeing them\nup to do more important things.</p>\n<p>I work largely with web technologies, but also play a bit with Integrated\nCircuits and the Internet of Things. I've been developing on Salesforce since\n2011, of which 4 years were in consultancies where I had exposure to a wide\nvariety of industries.</p>\n<p>I am:</p>\n<ul>\n<li>A New Zealander</li>\n<li>Trying to become Dutch</li>\n<li>A lover of all things Serverless</li>\n<li>A Software/Solutions architect</li>\n<li>Constantly looking for new things to learn</li>\n<li>An all round pragmatist</li>\n<li>A person that works well in teams, and enjoys Agile software development</li>\n</ul>\n<p>This website serves to give you some more information about what I do, what I've\ndone, and where I want to go to.</p>"}},{"node":{"frontmatter":{"title":"Experience","type":"post","content":"experience","color":"#809dff","backcolor":"#fafaff"},"html":"<p>My exposure has been largely to Salesforce related technologies since 2011,\nhowever in my spare time I focus largely on newer web technologies. I focus on\nthe best technology for the task at hand, however I tend to come back to\nReact for my frontends, and I generally focus on Serverless and Microservice\nArchitectures (implemented through AWS, GCP, Openwhisk) for my back ends.</p>\n<p>I generally prefer writing business logic, rather than presentational layers,\nbut I feel at home no matter where it is. I'm proficient in Javascript (ES6,\nES.Next) and Apex (Salesforce), but have an interest in Python and Go too.</p>\n<p>As for Salesforce technologies, I'm at home using Lightning, Visualforce, Apex,\nSFDX, Packaging, and any other technologies Salesforce chooses to implement.</p>\n<h3>Certifications</h3>\n<ul>\n<li>Salesforce Certified Developer (401)</li>\n<li>Salesforce App Builder</li>\n<li>Salesforce Platform Developer I</li>\n</ul>"}},{"node":{"frontmatter":{"title":"The Extras","type":"post","content":null,"color":"#7ef1b2","backcolor":"#f6fef9"},"html":"<p>You've manage to make it this far, thank you! I wanted to touch how I work.</p>\n<p>The things that make me most productive:</p>\n<ul>\n<li>Having a good product owner</li>\n<li>Using ViM for all my coding things</li>\n<li>Writing tests for all the things</li>\n<li>Being able to be open and honest with my team members</li>\n<li>Using good coding principles such as Clean Code, Domain Driven Design, and\nSOLID</li>\n<li>Being in an environment where I'm able to learn new things and able to throw a\njoke here and there</li>\n</ul>\n<p>I am a supporter of Open Source Software, and try to contribute where I can.\nI've pushed OSS iniatives at my work places, to ensure we're giving back.\nUnfortunately I'm not allowed to share a large amount of my daily work, as it's\nprotected IP, however these are some things I've tried to give back:</p>\n<ul>\n<li><a href=\"https://github.com/nzchicken/pipeline-dx\">Bitbucket SFDX + ANT pipeline container</a></li>\n<li><a href=\"https://www.github.com/nzchicken/clean-salesforce\">clean-salesforce (WIP)</a></li>\n<li><a href=\"https://www.github.com/dhoechst/Salesforce-Test-Factory\">Salesforce-Test-Factory</a></li>\n<li><a href=\"https://www.github.com/nzchicken/CalloutMock\">CalloutMock</a></li>\n<li><a href=\"https://www.github.com/nzchicken/Salesforce-Lightning-Flux\">Salesforce-Lightning-Flux</a></li>\n</ul>\n<p>The above list isn't always up to date, so feel free to check my\n<a href=\"https://www.github.com/nzchicken\">Github</a> for more information.</p>\n<p>When developing on Salesforce, these are the things I generally fall back on to\nspeed up my development time:</p>\n<ul>\n<li><a href=\"https://www.github.com/kevinohara80/sfdc-trigger-framework\">sfdc-trigger-framework</a></li>\n<li><a href=\"https://www.github.com/afawcett/declarative-lookup-rollup-summaries\">declarative-lookup-rollup-summaries</a></li>\n<li><a href=\"https://www.github.com/financialforcedev/fflib-apex-common\">fflib-apex-common</a></li>\n</ul>\n<p>This site was built using <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a>, not because it\nneeded to be, but because it looked like fun to play with. Some of my other more\n\"Showcase projects are here\":</p>\n<ul>\n<li><a href=\"https://nzchicken.github.io/sensors\">Sensors</a> - A set of sensors in my office\nthat measure how hard it is to work there based on Air Conditions</li>\n<li><a href=\"https://nzchicken.github.io/tasker\">Tasker</a> - A set of buttons on my desk\nwhich I can use to measure what I'm working on, and when</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Contact","type":"post","content":null,"color":null,"backcolor":"#fff"},"html":"<p>For any enquiries, please feel free to contact me on the following mediums</p>\n<ul>\n<li>Email: <a href=\"mailto:nayben@gmail.com?subject=Enquiry%20from%20your%20website\">nayben@gmail.com</a></li>\n<li>Mobile: <a href=\"tel:+31614272332\">+ 31 6 1427 2332</a></li>\n<li><a href=\"https://github.com/nzchicken\">Github</a></li>\n<li><a href=\"https://twitter.com/nzchicken\">Twitter</a></li>\n</ul>"}}]},"experience":{"edges":[{"node":{"frontmatter":{"title":"Technical Wizard","company":"Beethree","timeFrom":"2016-11-01T00:00:00.000Z","timeTo":"2017-11-01T00:00:00.000Z"},"html":"<ul>\n<li>Architect - Designing and delivering enterprise class solutions at scale across many projects. Managing structure of integrations for complex business requirements</li>\n<li>Consultant - Helping customers to focus on MVP to deliver quality enterprise software quickly and effectively</li>\n<li>Mentor - Developing a mentorship program to encourage rapid up-skilling of new employees. Supporting minorities in tech to open the door for new opportunities</li>\n<li>Developer - Designing, delegating, and delivering agile software at scale</li>\n<li>Delivery Optimiser - Utilising experience to produce a business standard on how to work with Scrum and Agile to deliver successful projects</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Senior Technical Consultant","company":"Fronde","timeFrom":"2014-08-01T00:00:00.000Z","timeTo":"2016-10-01T00:00:00.000Z"},"html":"<ul>\n<li>Senior Consultant - Working with customers to gather requirements, prioritise their needs, and design solutions to improve their business processes by using Salesforce best practices</li>\n<li>Architect - Taking high level requirements, expanding on important details, and building solutions that integrate many applications and platforms together into a single ecosystem</li>\n<li>Developer - Expanding on solution architecture to implement the moving parts of the design. Working closely with customers using Agile methodologies to produce the solutions they need. Utilising the latest development tools, languages, and fr    ameworks, to deliver future proofed solutions</li>\n<li>Motivator - Working closely with the rest of the consultant team, inspiring a \\forever learning\\ attitude, and being enthusiastic and approachable for any questions and help required</li>\n<li>Experimenter - Continuously experimenting with new technologies and pushing them to their limit. Integrating a physical brass bell with Salesforce to alert the office of company success (Sales, Project completion). Trying to get AWS Lambda to     run front end builds autonomously from Github pushes</li>\n<li>Speaker - Attend Dreamforce 2015, where I delivered a talk to an at capacity room on the intricacies of Dynamic Apex Binding utilising Salesforce configuration elements</li>\n</ul>"}},{"node":{"frontmatter":{"title":"Lead CRM Developer","company":"Vodafone New Zealand","timeFrom":"2012-11-01T00:00:00.000Z","timeTo":"2014-08-01T00:00:00.000Z"},"html":"<ul>\n<li>System Lead - Owned the design and architecture of the internal Salesforce.com instance for Vodafone New Zealand. Responsible for approving changes that would impact on the architecture of the Salesforce Implementation</li>\n<li>Developer - Built custom user interfaces, data automation mechanisms, and integrations where out of the box Salesforce configuration was either incapable of providing solutions, or delivered a bad user experience</li>\n<li>Analyst - Utilised past experience to design and develop dashboards for the wider Sales Leadership Team (SLT), and their direct reports. Produced and delivered training to individuals and teams on how to utilise the reports and dashboards to achieve their KPIs</li>\n<li>Innovator - Worked with the wider team to understand their pain points, and what I could do as a Developer to help improve their processes. Built a user specific My Status Board of what the user could do to improve their sales and time management and KPI. My Status Board was recognised by Salesforce for innovative thinking, design and implementation</li>\n</ul>"}},{"node":{"frontmatter":{"title":"CRM Developer","company":"Localist","timeFrom":"2012-04-01T00:00:00.000Z","timeTo":"2011-11-01T00:00:00.000Z"},"html":"<p>Localist utilised heavy Salesforce customization (Custom Objects, Visualforce, Apex, etc) to provide an automated solution of Sales to Print of their local business guide.</p>\n<p>I was one of the two direct employees working on the Salesforce.com instance, where we were accountable for data fixes, user administration, and development of the system. Due to the extensive customisation, and long deployment times, many improvements were made to existing customisation and configuration elements. Regular data audits and cleanups were performed to ensure financial data was not affected. Reports and Dashboards were utilised heavily to provide proactive monitoring of any data issues.</p>"}},{"node":{"frontmatter":{"title":"Various","company":"Spark New Zealand (prev. Telecom NZ)","timeFrom":"2007-02-01T00:00:00.000Z","timeTo":"2012-11-01T00:00:00.000Z"},"html":"<p>Various roles over 5 years including Reporting Analyst, Business Improvement Manager, and Business Analyst. More details can be provided on request.</p>"}}]}},"pageContext":{}}